[
  {
    "id": "1",
    "reference": "Jeremiah 29:11",
    "book": "Jeremiah",
    "chapter": 29,
    "verse": "11",
    "translations": {
      "NIV": "\"For I know the plans I have for you,\" declares the Lord, \"plans to prosper you and not to harm you, plans to give you hope and a future.\"",
      "KJV": "For I know the thoughts that I think toward you, saith the Lord, thoughts of peace, and not of evil, to give you an expected end.",
      "ESV": "For I know the plans I have for you, declares the Lord, plans for welfare and not for evil, to give you a future and a hope.",
      "NLT": "\"For I know the plans I have for you,\" says the Lord. \"They are plans for good and not for disaster, to give you a future and a hope.\"",
      "NKJV": "For I know the thoughts that I think toward you, says the Lord, thoughts of peace and not of evil, to give you a future and a hope.",
      "ASV": "For I know the thoughts that I think toward you, saith Jehovah, thoughts of peace, and not of evil, to give you hope in your latter end."
    },
    "reflection": "God's plans for us are filled with hope and purpose. Even when we can't see the path ahead, we can trust in His perfect timing and loving care.",
    "themes": ["Hope", "Trust", "Guidance"]
  },
  {
    "id": "2",
    "reference": "Philippians 4:13",
    "book": "Philippians",
    "chapter": 4,
    "verse": "13",
    "translations": {
      "NIV": "I can do all this through him who gives me strength.",
      "KJV": "I can do all things through Christ which strengtheneth me.",
      "ESV": "I can do all things through him who strengthens me.",
      "NLT": "For I can do everything through Christ, who gives me strength.",
      "NKJV": "I can do all things through Christ who strengthens me.",
      "ASV": "I can do all things in him that strengtheneth me."
    },
    "reflection": "Christ's strength is available to us in every situation. We are never alone in our struggles, and His power enables us to overcome any challenge.",
    "themes": ["Strength", "Faith", "Trust"]
  },
  {
    "id": "3",
    "reference": "Psalm 23:1",
    "book": "Psalm",
    "chapter": 23,
    "verse": "1",
    "translations": {
      "NIV": "The Lord is my shepherd, I lack nothing.",
      "KJV": "The Lord is my shepherd; I shall not want.",
      "ESV": "The Lord is my shepherd; I shall not want.",
      "NLT": "The Lord is my shepherd; I have all that I need.",
      "NKJV": "The Lord is my shepherd; I shall not want.",
      "ASV": "Jehovah is my shepherd; I shall not want."
    },
    "reflection": "When the Lord is our shepherd, we have everything we truly need. He guides us, protects us, and provides for us in every season of life.",
    "themes": ["Peace", "Trust", "Guidance"]
  },
  {
    "id": "4",
    "reference": "Proverbs 3:5-6",
    "book": "Proverbs",
    "chapter": 3,
    "verse": "5-6",
    "translations": {
      "NIV": "Trust in the Lord with all your heart and lean not on your own understanding; in all your ways submit to him, and he will make your paths straight.",
      "KJV": "Trust in the Lord with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge him, and he shall direct thy paths.",
      "ESV": "Trust in the Lord with all your heart, and do not lean on your own understanding. In all your ways acknowledge him, and he will make straight your paths.",
      "NLT": "Trust in the Lord with all your heart; do not depend on your own understanding. Seek his will in all you do, and he will show you which path to take.",
      "NKJV": "Trust in the Lord with all your heart, and lean not on your own understanding; in all your ways acknowledge Him, and He shall direct your paths.",
      "ASV": "Trust in Jehovah with all thy heart, and lean not upon thine own understanding: In all thy ways acknowledge him, and he will direct thy paths."
    },
    "reflection": "God's wisdom far surpasses our own. When we surrender our plans to Him and trust His guidance, He leads us on the right path.",
    "themes": ["Trust", "Wisdom", "Guidance"]
  },
  {
    "id": "5",
    "reference": "John 3:16",
    "book": "John",
    "chapter": 3,
    "verse": "16",
    "translations": {
      "NIV": "For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life.",
      "KJV": "For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.",
      "ESV": "For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life.",
      "NLT": "For this is how God loved the world: He gave his one and only Son, so that everyone who believes in him will not perish but have eternal life.",
      "NKJV": "For God so loved the world that He gave His only begotten Son, that whoever believes in Him should not perish but have everlasting life.",
      "ASV": "For God so loved the world, that he gave his only begotten Son, that whosoever believeth on him should not perish, but have eternal life."
    },
    "reflection": "God's love for us is so profound that He gave His greatest treasure. This verse is the heart of the gospel - salvation through faith in Jesus Christ.",
    "themes": ["Love", "Faith", "Hope"]
  },
  {
    "id": "6",
    "reference": "Romans 8:28",
    "book": "Romans",
    "chapter": 8,
    "verse": "28",
    "translations": {
      "NIV": "And we know that in all things God works for the good of those who love him, who have been called according to his purpose.",
      "KJV": "And we know that all things work together for good to them that love God, to them who are the called according to his purpose.",
      "ESV": "And we know that for those who love God all things work together for good, for those who are called according to his purpose.",
      "NLT": "And we know that God causes everything to work together for the good of those who love God and are called according to his purpose for them.",
      "NKJV": "And we know that all things work together for good to those who love God, to those who are the called according to His purpose.",
      "ASV": "And we know that to them that love God all things work together for good, even to them that are called according to his purpose."
    },
    "reflection": "Even in difficult circumstances, God is working for our good. He can take any situation and use it for His purpose in our lives.",
    "themes": ["Hope", "Trust", "Faith"]
  },
  {
    "id": "7",
    "reference": "Isaiah 40:31",
    "book": "Isaiah",
    "chapter": 40,
    "verse": "31",
    "translations": {
      "NIV": "But those who hope in the Lord will renew their strength. They will soar on wings like eagles; they will run and not grow weary, they will walk and not be faint.",
      "KJV": "But they that wait upon the Lord shall renew their strength; they shall mount up with wings as eagles; they shall run, and not be weary; and they shall walk, and not faint.",
      "ESV": "But they who wait for the Lord shall renew their strength; they shall mount up with wings like eagles; they shall run and not be weary; they shall walk and not faint.",
      "NLT": "But those who trust in the Lord will find new strength. They will soar high on wings like eagles. They will run and not grow weary. They will walk and not faint.",
      "NKJV": "But those who wait on the Lord shall renew their strength; they shall mount up with wings like eagles, they shall run and not be weary, they shall walk and not faint.",
      "ASV": "But they that wait for Jehovah shall renew their strength; they shall mount up with wings as eagles; they shall run, and not be weary; they shall walk, and not faint."
    },
    "reflection": "When we wait on the Lord and put our hope in Him, He renews our strength. In our weariness, He gives us the power to soar above our circumstances.",
    "themes": ["Strength", "Hope", "Trust"]
  },
  {
    "id": "8",
    "reference": "Matthew 11:28",
    "book": "Matthew",
    "chapter": 11,
    "verse": "28",
    "translations": {
      "NIV": "Come to me, all you who are weary and burdened, and I will give you rest.",
      "KJV": "Come unto me, all ye that labour and are heavy laden, and I will give you rest.",
      "ESV": "Come to me, all who labor and are heavy laden, and I will give you rest.",
      "NLT": "Then Jesus said, 'Come to me, all of you who are weary and carry heavy burdens, and I will give you rest.'",
      "NKJV": "Come to Me, all you who labor and are heavy laden, and I will give you rest.",
      "ASV": "Come unto me, all ye that labor and are heavy laden, and I will give you rest."
    },
    "reflection": "Jesus offers rest for our weary souls. When life's burdens become too heavy, we can bring them to Him and find peace.",
    "themes": ["Peace", "Trust", "Love"]
  },
  {
    "id": "9",
    "reference": "Psalm 46:10",
    "book": "Psalm",
    "chapter": 46,
    "verse": "10",
    "translations": {
      "NIV": "He says, 'Be still, and know that I am God; I will be exalted among the nations, I will be exalted in the earth.'",
      "KJV": "Be still, and know that I am God: I will be exalted among the heathen, I will be exalted in the earth.",
      "ESV": "Be still, and know that I am God. I will be exalted among the nations, I will be exalted in the earth!",
      "NLT": "Be still, and know that I am God! I will be honored by every nation. I will be honored throughout the world.",
      "NKJV": "Be still, and know that I am God; I will be exalted among the nations, I will be exalted in the earth!",
      "ASV": "Be still, and know that I am God: I will be exalted among the nations, I will be exalted in the earth."
    },
    "reflection": "In the busyness and chaos of life, God calls us to be still and remember who He is. Taking time to rest in His presence brings clarity and peace.",
    "themes": ["Peace", "Trust", "Wisdom"]
  },
  {
    "id": "10",
    "reference": "Joshua 1:9",
    "book": "Joshua",
    "chapter": 1,
    "verse": "9",
    "translations": {
      "NIV": "Have I not commanded you? Be strong and courageous. Do not be afraid; do not be discouraged, for the Lord your God will be with you wherever you go.",
      "KJV": "Have not I commanded thee? Be strong and of a good courage; be not afraid, neither be thou dismayed: for the Lord thy God is with thee whithersoever thou goest.",
      "ESV": "Have I not commanded you? Be strong and courageous. Do not be frightened, and do not be dismayed, for the Lord your God is with you wherever you go.",
      "NLT": "This is my command—be strong and courageous! Do not be afraid or discouraged. For the Lord your God is with you wherever you go.",
      "NKJV": "Have I not commanded you? Be strong and of good courage; do not be afraid, nor be dismayed, for the Lord your God is with you wherever you go.",
      "ASV": "Have not I commanded thee? Be strong and of good courage; be not affrighted, neither be thou dismayed: for Jehovah thy God is with thee whithersoever thou goest."
    },
    "reflection": "God commands us to be strong and courageous because He is always with us. His presence gives us confidence to face any challenge without fear.",
    "themes": ["Strength", "Faith", "Trust"]
  }
]